<?php
/**
 * Created by PhpStorm.
 * User: lihaoran
 * Date: 2017/6/12
 * Time: 11:54
 */

return array(

    'allow_pay_type' => array(
        '1',// "微信支付"
        '2',//支付宝
        '7',//财付通
        '12',//京东支付
        '17',//applePay
        '20',//格瓦拉-招行直连
        '24',//格瓦拉-广东农商银行
        '26',//格瓦拉-浦发直连
        '27',//格瓦拉-银联手机WAP支付
        '28',//格瓦拉-小浦支付(浦发信用卡)
        '99',//订单预算
    ),
    'gawara_pay_type' => array(
        '20',//格瓦拉-招行直连
        '24',//格瓦拉-广东农商银行
        '26',//格瓦拉-浦发直连
        '27',//格瓦拉-银联手机WAP支付
        '28',//格瓦拉-小浦支付(浦发信用卡)
    ),

);