<?php

//错误信息，从-11开始
return [

    '0' =>
        [
            '0' => 'success',
        ],
    //从-10开始
    '-11' =>
        [
            '-1001' => '数据不存在',
            '-1002' => '更新失败',
            '-2000' => '该用户不存在',
            '-2001' => '该第三方数据不存在',
            '-2002' => '该手机号已经存在',
            '-2003' => '注册失败',
            '-2004' => '注册成功，获取信息失败',
            '-2005' => '该第三方UID已经存在',
            '-2006' => '注册失败',
            '-2007' => '解绑失败',
            '-2008' => '用户名或密码错误',
            '-2009' => '绑定手机号失败',
            '-2010' => '当前用户手机号不为空',
            '-2011' => '只能绑定第三方登陆用户手机号',
            '-2012' => '手机号修改失败',
            '-2013' => '手机号已存在',
            '-2014' => '密码修改失败',
            '-2015' => '禁止修改第三方用户密码',
            '-2016' => '原密码错误',
            '-2017' => '重置密码失败',
            '-2018' => '该用户已绑定第三方账号',
            '-2019' => '该Token已存在',
            '-2020' => '用户Token信息存储失败',
            '-2021' => '缺少AppKey',
            '-2022' => '加密失败',
            '-2023' => '旧手机号码不一致',
            '-2024' => '手机号不存在',
            '-2025' => '手机号码已被其他账号占用',
            '-2026' => '手机号码已被当前账号绑定',
            '-2027' => '当前账号已被绑定过',
            '-2028' => '第三方凭证验证失败或过期',
            '-2029' => '用户密码已存在',
            '-2030' => '密码设置失败',
            '-2031' => '您好您的账号需要短信验证',
            '-2032' => '原密码和新密码相同',
        ],
    // 手机号验证
    '-19' =>
        [
            '-1001' => '系统异常，验证失败',
            '-1002' => '操作超时，请重新获取验证码',
            '-1003' => '验证码错误',
            '-1004' => '验证码已过期，请重试',
            '-1005' => '发送验证码过于频繁,请稍后再试',
            '-1006' => '验证已失效,请重新获取验证码',
            '-1007' => '图形验证码错误',
            '-1008' => '请输入图形验证码',
            '-1009' => '图形验证码配置文件获取失败',
            '-1010' => '原手机号短信验证码错误',
            '-1011' => '新手机号短信验证码错误',

        ],

    '-20' =>
        [
            '-1001' => '获取订单失败',
        ],
    //滑动验证类的错误（需跳转）
    '-22' =>
        [
            '-1001' => '',
        ],
    //滑动验证类的错误（不跳转）
    '-23' =>
        [
            '-1001' => '滑动验证失败 请点击重试'
        ],
    '-24' =>
        [
            '-1001' => '支付方式有误,请重新选择!',
        ],
    //app 内置资源类错误
    '-25' =>
        [
            '-1001' => '版本信息不存在',
        ],
];
?>